import React from "react";
import { Link } from "react-router-dom";
import { useSelector, useDispatch } from "react-redux";
import { setPlusStep } from "../Redux/slices/questionSlice";
export const Result = () => {
  const step = useSelector((state) => state.question.step);
  const value = useSelector((state) => state.question.value);
  const dispatch = useDispatch();
  return (
    <div className="result">
      <h2>Який ти їстивний гриб?</h2>
      <div>
        {value == 0
          ? "Маслюк слизький. Росте у модринових лісах; у липні — жовтні. Добрий їстівний гриб. Використовують свіжим. М'якуш у шапці білий, з часом брудно-білий, у ніжці жовтуватий, згодом коричнюватий, при розрізуванні на повітрі над пластинками та в ніжці стає брудно-синюватим, запах і смак приємні."
          : value < 4
          ? "Маслюк зернистий. Дуже добрий їстівний гриб другої категорії, проте швидко псується. Використовують свіжим, про запас сушать, солять, маринують."
          : value < 7
          ? "Білий гриб. Найкращий з відомих їстівних грибів. Зустрічається по всій Україні. Росте у листяних (під дубом, буком, грабом, березою, ліщиною) і хвойних (під сосною, ялиною) лісах. Трапляється як опецькуватий, часто з шапкою меншою від ніжки, так і крисатий, з шапкою учетверо більшою за ніжку."
          : value < 9
          ? "Сироїжка світло-жовта. Спорова маса жовта-вохряна. Спори 8-10 Х 7-8 мкм, шипасті. Ніжка 5-9 Х 2-2 см, донизу злегка потовщена, білувата, з віком сіріє, щільна. М'якуш солодкий, білий, при розрізуванні сіріє, з приємним запахом. Зустрічається по всій Україні в листяних лісах (переважно під березою та вільхою), на вогких місцях; у червні — вересні"
          : value < 10
          ? "Підвишень. Зустрічається по всій Україні: у листяних і мішаних лісах, на галявинах, у садах, на трав'янистих місцях. Спорова маса рожева. Спори 10-14 Х 5-6 мкм, рожеві, веретеноподібно-овальні, з поздовжніми 5-7 гранями. Ніжка 3,6 Х 0,8-2 см, щільна, іноді ексцентрична, білувата, згодом кольору шапки, біля основи білоповстиста. М'якуш білий, приємний на смак, пахне щойнозмеленим борошном."
          : "Печериця садова. М'якуш білий, щільний, при розрізуванні червоніє, у сухих плодових тіл м'якуш червонувато-бежевий. Американський вчений Їнонг Янг (англ. Yinong Yang) з Університету штату Пенсильванія за допомогою технологі CRISPR-Cas9 вніс зміни до ДНК печериці садової, що запобігає потемнінню плодових тіл при механічному ушкодженні."}
      </div>
      <Link to="">
        <input
          className="input_button"
          onClick={dispatch(setPlusStep(step * 0))}
          type="button"
          value="Рестарт"
        />
      </Link>
    </div>
  );
};
